[
  {
    "path": "posts/2021-08-27-carney-conversations/",
    "title": "Carney Conversations: The next generation of scientists on the future of brain science",
    "description": {},
    "author": [],
    "date": "2021-08-27",
    "categories": [
      "psych",
      "grad school",
      "media coverage"
    ],
    "contents": "\nThis blog post was originally written on August 27, 2021. It was last updated on 2021-08-27 using R Markdown.\nI had a great time speaking as one of the grad student panelists for a recent Carney Conversations discussion, “The next generation of scientists on the future of brain science”. This discussion was moderated by Drs. Diane Lipscombe and Christopher Moore, and additionally featured the panelists Kaitlyn Hajdarovic and Marc Powell.\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-10-28T15:19:23-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-27-new-tutorials/",
    "title": "New tutorials for HDDM and PsychToolbox",
    "description": {},
    "author": [],
    "date": "2021-08-27",
    "categories": [
      "psych",
      "tutorials",
      "coding",
      "matlab",
      "python"
    ],
    "contents": "\nThis blog post was originally written on August 27, 2021. It was last updated on 2021-08-27 using R Markdown.\nI’ve uploaded some new tutorials to my GitHub!\nThe first tutorial covers drift diffusion modeling (DDM) using the Python library HDDM, which contains tools for hierarchical Bayesian parameter estimation. In short, DDM allows you to model how people make (relatively fast) binary-choice decisions, by decomposing choice and reaction times into psychologically-interpretable parameters. These materials were developed for the 2021 Carney Computational Modeling Workshop hosted at Brown University. The GitHub repository contains all of the workshop materials (slides, sample data, code) and instructions on how to install/use HDDM (see the wiki for details, including instructions for playing around with HDDM in the cloud).\nThe second tutorial covers the creation of computerized experiments using the Matlab library PsychToolbox, and was written for undergrads in mind. No prior coding experience is expected! These materials were developed for a workshop delivered in 2018, but are expected to continue working as-is. Sample starter code is also available in this GitHub repository.\nFinally, mostly as an organizational note to myself, I’ve discovered that GitHub repos have a really nice wiki feature built in (yes, I’m very late to the game), so I hope to copy some misc info from my website (e.g., installation instructions) to the relevant repos. This minimizes the possibility of information getting lost if/when I reorganize my website, and also makes it easier for people to find relevant information without having to cross-reference stuff from this site vs my GitHub.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-10-28T15:19:23-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-07-12-no-code-intro-programming/",
    "title": "No-code introduction to programming",
    "description": {},
    "author": [],
    "date": "2021-07-12",
    "categories": [
      "tutorials",
      "coding"
    ],
    "contents": "\n\nContents\nDatatypes\nOperators\nAssignment operators\nArithmetic operators\nConditional operators\nLogical operators\n\nControl logic\nIteration\nfor loops\nwhile loops\n\nFunctions\nUsing functions\nFunctions are flexible\nWriting custom functions\n\nVariables\nSummary\nNext steps\n\nIncreasingly, research in the social sciences requires some knowledge of programming and computing. For example, it is becoming increasingly common to program computerized experiments, and to perform statistical analyses using code.\nThis came as an incredibly rude surprise when I embarked upon my first independent research project as a college senior. Through trial and error (frankly, mostly error), I’ve gone from flunking two introductory computer science classes to teaching programming. Because of this, I understand the feeling of being code-phobic, and just how much of an overwhelming task it can feel like to learn programming.\nSo, this is my best attempt at synthesizing some of the key ideas and insights about programming without writing a single line of code. The goal is to familiarize you with some of these ideas in plain English so that when you’re learning a particular programming language, the act of writing code is just learning how to express an idea using some fancy computer syntax.\nThe only prior knowledge I assume is a little bit of high-school level algebra. I’ll review the relevant concepts along the way, so if you feel like your math is a little shaky, you’ll still be able to follow along.\nDatatypes\nThere are different types of objects out in the world. For example, there are fruits and there are bowling balls. Obviously, these are different. But if you’re not paying attention, you might mistake one type of object for a different type of object. A big watermelon is about the same weight as a bowling ball. An orange is approximately the right shape, and many bowling balls are orange-colored. But of course, you wouldn’t want to try biting into a bowling ball, and you probably don’t want to fling a watermelon at bowling pins.\nThe same is true for digital objects that are handled by your computer. It might seem obvious that the number 5 and the text \"five\" are different from each other. But if we aren’t paying attention, we might miss the fact that the computer is not processing the number 5, but the text \"5\". From the computer’s perspective, trying to add 5 and \"5\" makes about as much sense as trying to add 5 and \"Detroit\".\nThis is the key idea behind datatypes. There are certain types of data, and what you’re allowed to do with those data depends on what their types are.\nFrom high school math classes, you might remember that an integer is a number that doesn’t contain a fraction or a decimal point. These are all examples of integers: -99, 0, 200. On a standard number line, integers are the “tick marks.”\nWhat about numbers that do contain a fraction or decimal point? This datatype is called a float. You can think of it as a number that “floats” on a number line between two integers. Sometimes, the computer uses the float datatype to represent a number that looks like an integer. For example, we know that the result of 2.5 + 2.5 = 5, which looks like an integer to the human mind. But, because the computer started off with a float datatype 2.5, adding things to the float results in another float.\nWhy would there be an integer datatype at all, if it seems like a float is capable of representing the same information, and more? This is a great question, and I’ll try to answer it without getting into too much technical detail. You might have heard that computers represent information in binary. In other words, computers only understand the values 0 and 1. We can get more complex representations by creating longer sequences of these two values. Integers are actually pretty easy to represent using binary, so computers are able to store information about very small and very large integers with the same amount of precision. On the other hand, floats are much harder to represent precisely using binary. You might be familiar with the idea of rounding error. We know that 1.25 + 1.33 = 2.58 if we don’t round. But if we round to the first decimal point, 1.25 + 1.33 = 2.6. Suddenly, our computation has become much less precise. Representing information in binary means that we lose precision when we’re working with complex datatypes like floats. When precision is really important, it might be better to use integers when possible.\nAnytime we want to work with text, the computer will represent that using the string datatype. Think about a sentence as being a string of text, and that will help you remember. Strings can get confusing if we’re not paying close attention. For example, in a psychology experiment, we might label one of our images something like \"stimulus_5.jpg\". We later ask the computer to extract out the 10th character, which is \"5\". Well, to the human mind, that looks like a number. But from the computer’s perspective, we started out with a string, meaning that anything we pull out from it is still a string.\nFinally, we have the Boolean datatype, which can only take two values: true and false. If you’re not familiar with Dolly Parton’s classic song Jolene, consider this a cultural lesson and go listen to it now (I grew up in East Tennnessee, where Dolly Parton’s from, and she’s considered royalty around those parts). Now that you have this song stuck in your head, remember the Boolean datatype by singing, “Boolean, Boolean, Boolean, Booleeeeeean… Yes/no, are you going to take my man?” Different languages use different syntax to represent the Boolean. Some use 0=False and 1=True, and others simply use the words True and False.\nOperators\nI’m going to provide two unsatisfying definitions of operators.\nYou have two numbers. What do you want to do with those numbers? Whatever you decide to do (add, subtract, see if one is greater than the other, etc), the thing that allows you “to do” is an operator. So the operator for “add” is +, and you can write the expression A + B to add A and B. Similarly, the operator for “greater than” is >, and you can ask whether A is greater than B by writing A > B.\nYou’ll note that when we write an expression, we don’t have to use language. We can use fancy symbols like + and > instead. So, if you see a fancy symbol in someone’s code, it’s likely an operator.\nThere are four major kinds of operators: assignment, arithmetic, conditional, and logical.\nAssignment operators\nIn your high school math classes, you might remember using variables, like A = 5. The equal sign = is an assignment operator because you use it to assign the value 5 to the variable A.\nArithmetic operators\nArithmetic operators are pretty easy because they (mostly) look like the symbols we commonly use in math classes. We add using the plus sign +, subtract using the minus sign -, multiply using the star (also known as an asterisk) *, and divide using the slash /.\nConditional operators\nConditional operators allow you to check whether something is true or false (pop quiz: what datatype is produced when you use a conditional operator?). For example, we might want to ask, “Is A greater than B?” We could write the expression A > B, which is either true or false.\nConditional operators are a little trickier because they’re written more abstractly. For example, how would you test whether A is equal to B? Remember, we’ve already used the equal sign = as an assignment operator. So to get around this, we use the double-equal operator == to mean “is equal to”. Similarly, it’s pretty hard to type the mathematical symbol “is not equal to” ≠, so we’ve got to find an alternative. The exact syntax is different depending on the language, but it’s common to see != where the ! operator means “not”. The operators “greater than” > and “less than” < are pretty easy because we use these symbols in math too. But how would we write something like “greater than or equal to” given that ≤ is also hard to type? See if you can make a guess, based on the operator used for “not equal to”. If you guessed >= and <=, then you’re exactly right.\nWhy are they called conditional operators? Maybe when you were a kid, you’d ask your parents if you could go over to your friend’s house. They might have told you, “Sure, on one condition…” And then you’d groan because you knew that your ability to go to your friend’s house was conditional on you cleaning your room.\nLogical operators\nSometimes, you want to check whether multiple conditions are true. Maybe your parent told you, “Sure, you can go to your friend’s house IF you clean your room AND do your homework first.” To do this, you would use logical operators. We’ve actually already seen one at work, because NOT is also logic. (For example: “Can you go to your friends house? Not if your room is dirty.”)\nBelow, you can find the major logical operators and examples of how they are expressed in R:\nIF (this one is special because it’s written in plain English)\nAND is written as & (“ampersand”)\nOR is written as | (surprisingly, there doesn’t seem to be a more elegant name for this other than “vertical-bar”)\nNOT is written as ! (“exclamation mark”)\nFor the most part, these operators are referred to by the logical operations they perform. So, it’d be weird to say “A ampersand B”, and more normal to say “A AND B”.\nControl logic\nTogether, conditional and logical operators can be used to do really powerful things. For example, it lets you decide whether you want to eat a sandwich.\nWell, do you? How do you know?\nWhen we make decisions in our everyday life, we want to control our actions, depending on what we know to be logically true about the world. Hence, control logic.\nMost likely, you only want to eat a sandwich IF you’re hungry. But there are also other things that are true about the world, like the fact that you don’t have any bread in your kitchen. So maybe you’ll only eat a sandwich IF you’re hungry AND you have all the ingredients.\nThis is control logic at work! Note that in order to execute the action “eat a sandwich”, you have to check whether two things are true: 1) Are you hungry? 2) Do you have all the ingredients needed to make a sandwich? If only one of these things is true, then you won’t eat a sandwich.\nIf we were asking a computer to make a decision for us, how would it decide? We won’t write any real code (I did promise you that we wouldn’t), but we can write fake code (known as pseudocode) which would get the job done:\n\nif hungry==True & have_ingredients==True:\n    eat_sandwich\n\nSometimes, when I feel stressed out, I’ll eat something even if I’m not hungry. How would we express this in pseudocode?\n\nif (hungry==True | stressed==True) & have_ingredients==True:\n  eat_sandwich\n\nThe parentheses are used the same way they’re used in algebra. Expressions that are inside the same set of parentheses get evaluated together. What would happen if we grouped the operators differently?\n\nif hungry==True | (stressed==True & have_ingredients==True):\n  eat_sandwich\n\nHint: What would this control logic have you do if you were hungry, but had no sandwich ingredients? Is that sensible?\nIteration\nLet’s say we work for a car manufacturing company, and we’re trying to program a robot arm to tighten the screws that keep the wheels attached to the car (technically, these are lug nuts, but let’s just say screws). How would we do that?\nWe could write pseudocode that looks like this:\n\ngrab_screw\nturn_screw\nturn_screw\nturn_screw\nturn_screw\n... (copy/paste many more times)\n\nWe can see that to tighten a single screw, we’d need a thousand lines of code. Surely, there is a better method! This is the problem of iteration, which is a fancy word for “do something over and over again.” So, how can we efficiently iterate through all of the screw turns?\nfor loops\nLet’s imagine that we know ahead of time exactly how many times a screw needs to be turned before we stop. In this case, we could write:\n\ngrab_screw\nfor 1 through 1000:\n  turn_screw\n\nThis is known as a for loop, because we’re asking the computer to iterate through loops for a pre-determined amount of time.\nwhile loops\nBut oftentimes, we can’t predict the future, so we don’t know how many loops we need to iterate through. In this case, we could do something like this:\n\ngrab_screw\nscrew_is_loose = True\nwhile screw_is_loose == True:\n  turn_screw\n\nOnce the screw is no longer loose, the loop will stop, and the robot will stop turning the screw. This is known as a while loop, because we’re asking the computer to iterate through loops while a condition is met.\nFunctions\nMaybe in algebra class, you remember learning about functions. They take the form \\(f(x) = x + 7\\), which is about the most boring thing we could use a function to do. If you’re asked to solve \\(f(5)\\), you assign \\(x = 5\\), then solve \\(5 + 7 = 12\\).\nThe name of the function, in this case, is \\(f\\). The parentheses surround the variable \\(x\\), which is the argument of the function (also known as a parameter, or an input). When you call the function, you supply an argument, and in doing so, you assign a value to \\(x\\).\nUsing functions\nLet’s use functions to do more interesting things. We can illustrate using Ke$ha’s 2009 hit song “TiK ToK” (which perhaps is a dated cultural reference that reveals how old I am…).\n\nWake up in the morning feelin’ like P. Diddy\nGrab my glasses, I’m out the door, I’m gonna hit this city\nBefore I leave, brush my teeth with a bottle of Jack\n’Cause when I leave for the night, I ain’t coming back\n\nHow might we write this in pseudocode?\n\nwake_up(morning)\nfeel_like(p_diddy)\ngrab(glasses)\nbrush_teeth(jack_daniels)\nleave = walk_out(door)\nif leave == True:\n  navigate_to(location = city, come_back = False)\n\nNote that in the last line, we’ve specified two arguments to the function navigate_to, and we’ve also provided named arguments. We don’t necessarily have to do that, as you can see here:\n\nwake_up(morning)\nfeel_like(p_diddy)\ngrab(glasses)\nbrush_teeth(jack_daniels)\nleave = walk_out(door)\nif leave == True:\n  navigate_to(city, False)\n\nWe could also name every argument. The name of each argument is specified by whoever makes the function, and a good function-writer will use informative names for each argument. Here’s an example:\n\nwake_up(when = morning)\nfeel_like(emotion = p_diddy)\ngrab(object = glasses)\nbrush_teeth(toothbrushing_substance = jack_daniels)\nleave = walk_out(portal = door)\nif leave == True:\n  navigate_to(location = city, come_back = False)\n\nFunctions are flexible\nBy supplying different arguments to the same functions, we could make this song about me instead. This is really nice, because it gives you a lot of flexibility. Just by changing the arguments, we’ve gone from a party animal to a grad student.\n\nwake_up(late_afternoon)\nfeel_like(lazy_bum)\ngrab(glasses)\nbrush_teeth(toothpaste)\nleave = walk_out(nowhere)\nif leave == True:\n  navigate_to(location = Providence, come_back = True)\n\nWriting custom functions\nEven better… if this is a routine that I iterate through often, I can nest this sequence of functions inside a custom function. How might I write this?\n\nFunction start_day(is_pandemic):\n    wake_up(late_afternoon)\n    feel_like(lazy_bum)\n    grab(glasses)\n    brush_teeth(toothpaste)\n    \n    if is_pandemic == True:\n        leave = walk_out(nowhere)\n    else:\n        leave = walk_out(work)\n    \n    if leave == True:\n        navigate_to(location = Providence, come_back = True)\n\nWhy is this useful? Because now I have a sequence of actions that I can call whenever I need to start my day. For example, I can combine my custom function with iteration and control logic to control my day-to-day behavior:\n\nwhile grad_student == True:\n    is_pandemic = covid19_still_around()\n    start_day(is_pandemic)\n    work_all_day(urgent_upcoming_deadline = True)\n    sleep()\n\nLet’s break this down into plain English. While it’s true that I’m a grad student, I first check whether the covid19 pandemic is still around. If so, supplying that argument to the function start_day causes me to stay home. If not, supplying that argument causes me to walk to work.\nVariables\nThere’s one last key idea you need to understand before you’ve understood the most fundamental concepts in programming, which is that variables are containers for information.\nSometimes, the containers are small, and they only fit one piece of information inside them. These are called scalar variables. Here’s an example of a scalar assignment: x = \"fish\"\nSometimes, the containers are bigger, and they can fit lots of scalars inside of them. For example: x = [\"fish\", \"painting\", \"iPhone\"]. This is a vector that’s assigned to the variable x. If it helps, you can think of a vector as being like a single row of a datatable.\nSometimes, the containers are even bigger, and they can fit lots of vectors inside of them. This is sometimes called an array, a matrix, a dataframe, a datatable, and so on. For example:\n\nx = [\n  [\"fish\", \"painting\", \"iPhone\"],\n  [\"crocodile\", \"song\", \"Android\"],\n  [\"hummingbird\", \"sculpture\", \"Nokia\"]\n]\n\nNow, the variable x contains a 3-by-3 array, since there are three rows and three elements inside each row.\nSummary\nI’ve stayed true to my word: we haven’t written a single line of “real” code here. But, using pseudocode, we’ve developed some intuitions about how real code could be written in various computing languages.\nWhat have we learned?\nDatatypes: There are different types of data. They’re useful for different things.\nOperators: Using operators, we can take two pieces of data and “do” something with them.\nControl logic: Using operators, we can control whether certain actions are taken.\nIteration: Using control logic, we can perform the same actions over and over and over again.\nFunctions: In order to do anything functional with data, we have to define i) which data to use, and ii) what actions to perform on those data. Functions specify both of these things.\nVariables: We can store the results of our computation inside containers. If needed, we can even put those containers into bigger containers.\nAll of these ideas can be combined with each other in infinitely complex ways, and it is this process of combining ideas that defines the art of programming.\nNext steps\nSo hopefully, after reading this little guide, you feel less afraid of writing “real” code. That’s great! If you understand these very fundamental ideas, you can learn to translate them into language-specific syntax.\nProgramming languages that are commonly used in psychology are:\nPython (General-purpose language with libraries that support the building of computerized experiments, as well as performing statistical analysis/data science)\nR (Designed for performing statistics and data science)\nMatlab (Heavily-optimized numeric computation. Also home to PsychToolbox, a library that is used to program computerized experiments)\nJavaScript (Web development/experiments)\nIf you like my teaching style, I’ve written other tutorials that you might find useful. You can find a directory of posts here.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-10-28T15:19:23-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-07-12-r-tutorial-setup/",
    "title": "Setup guide for R tutorials",
    "description": {},
    "author": [],
    "date": "2021-07-12",
    "categories": [
      "tutorials",
      "r",
      "coding"
    ],
    "contents": "\n\nContents\nSetting up R\nInstall R\nInstall RStudio\nSet up RStudio\nDownload R libraries\n\nSetting up GitHub\nCreate GitHub account\nInstall GitHub Desktop\n\nFile and folder structure\n…Now what?\n\ninto-the-tidyverse is a self-contained set of tutorials for data wrangling/analysis using R (via RStudio), with a very heavy emphasis on the tidyverse libraries. These are state-of-the-art tools that have always been (and always will be) free and open-source.\nThese tutorials require you to use GitHub (via the easy-to-use GitHub Desktop interface), and encourage the practice of version control. Learning how to use GitHub is an increasingly important part of learning how to do data science. For that reason, you will be required to use GitHub in order to follow along with these tutorials. The learning curve is not too steep, and these skills will serve you well in the future.\nSetting up R\nInstall R\nThe first thing you’ll need to do is to install R from CRAN (Comprehensive R Archive Network).\nThis will install the R programming language, some essential libraries, and a text-based console that might remind you of an old-school terminal window.\n\n\n\nInstall RStudio\nWe will not be using the R console directly. Instead, we’ll be using RStudio, which builds on top of the console and gives you a lot of nice tools that help you work more efficiently. Once R is installed, you’ll then want to install RStudio.\nYou’ll immediately note that you have a lot more tools at your disposal:\nR Console: Look familiar? You can use this console to type commands, just like in the “base” R console.\nScript Editor: Instead of using the console to type your commands one-by-one, you can write a script that contains all of your commands. That way, it’s easy to replicate an analysis because all of your code is contained within a single document, and can be run at will.\nVariable Viewer: When you start loading, creating, and manipulating data, you’ll see it here.\nEverything Else: I primarily use this panel to look at plots, or to look at the help documentation for functions I’m using.\n\n\n\nSet up RStudio\nOpen up RStudio and then open up Preferences. Find the “Workspace” settings. Make sure the checkbox is de-selected for “Restore .Rdata into workspace at startup”. Specify never as the option for “Save workspace to .Rdata on exit”. This will ensure that every time you open up RStudio, you start out with a clean working environment. You’d be amazed at how many problems can be prevented by doing this.\nDownload R libraries\nYou’ll need to install the following R libraries. Copy/paste the following code into the console window, then press enter to run it. We may need to install other libraries in the future, but these ones are so useful that I use them in virtually every project.\n\n\ninstall.packages(\"tidyverse\")\ninstall.packages(\"here\")\ninstall.packages(\"janitor\")\n\n\n\nSetting up GitHub\nCreate GitHub account\nYou will need to create an account at GitHub.\ngit is a system for performing version control. What does that mean? Basically, it allows you to save “snapshots” of your files at any given moment. This allows you to track how your code (and data) change over time. So if you accidentally delete a lot of important code, and later realize that you need to recover it, git allows you to go back to a snapshot that contains the code you want. So you can think of it like an archiving system.\nGitHub is an online data storage platform that uses git to store a full archive of changes you’ve made to a particular project. It allows you to keep a “synchronized” copy of the most up-to-date files on any computer that’s given access.\nLet’s walk through some of terminology, which will help you to understand how GitHub works. Let’s say you’ve got some projects on your computer’s hard drive. Each project is stored in its own repository. When you start using git to version control your repository, it creates some hidden folders which contain a full archive of changes you’ve made (sort of - more on this in a second). Using git, you can then specify when to create a snapshot of your repository. This snapshot is called a commit because you’re committing to saving a copy of your repository at this exact moment in time. Importantly, you choose when to commit. Different people have different preferences. Some people like to commit at set time increments, regardless of whether their changes are big or small. Some people wait to commit until they have something they feel is “worth” committing. This is entirely up to you, and you’ll develop your own preferences as you gain experience.\nOnce you’ve committed something, you’ve saved a snapshot on your personal computer. But, that commit only lives on your computer. If you dropped your computer on the floor and destroyed its hard drive, your archive is gone forever. This is where GitHub comes in. You can save a copy of your files and your commit history onto GitHub, which allows you to clone a copy of your repository (and its full commit history!) onto any other computer. When you upload your commits to GitHub, it’s called a push. The GitHub repository contains only the “latest” versions of your files, which is dictated by when you commit and push your commits to GitHub. This can get a little more complicated when there are multiple collaborators editing files in the same repository. For simplicity, we’ll only consider two cases: 1) when a collaborator pushes a commit while you’re in the middle of changing something, and 2) how to prevent conflicting changes by working on a parallel copy of the repository.\nOnce you’re done changing something in your code, you might create a commit and try pushing that change to GitHub. Only to find that your collaborator has also been changing things in the code, and has pushed something before you had a chance to work on the most “updated” version of your repository. Since your commit is now on an “older” version of the repository, you must first synchronize your computer’s (older) version of the repository with the (newer) GitHub version. When you check whether there’s a newer version, this is called a fetch. When you detect that there’s a newer version, you then pull the newer version on your computer. In the best-case scenario, there is no merge conflict, and you can then push your commit without any further action. In the worst-case scenario, there is a merge conflict that you manually have to resolve. That is a giant headache to do, and you’ll want to avoid merge conflicts as much as possible. The easiest way to do this is to work with a fork (you could also do this with a branch, but we won’t be using them in this workshop… once you understand forks, it’ll be really easy to google what branches do in the future).\nYou might be familiar with the idea of a “multiverse” from comic books or science fiction. You’re living in the “main” timeline, but there are alternative realities that come in and out of existence at key moments in time. For example, there might be an alternative reality that’s exactly the same as this one, except that Ringo Starr never became the drummer for the Beatles. That would be an alternative universe that “forked” from our reality in 1962. That is exactly the logic of git. You could be working on a project with a collaborator who wants to try rewriting some existing code, but who wants to avoid messing up your existing data analysis pipelines. That collaborator could create a fork of your project, which diverges from the main timeline at a particular moment in time. The collaborator could then do whatever they wanted with their forked copy of the repository, without ever affecting what happens in the main copy. In principle, they could maintain a separate fork forever. Oftentimes, though, they’ll finish editing the code and will then want to merge it with the main timeline. This gives you a gentle way of merging the timelines together, since you can work through any would-be merge conflicts before trying to merge the two timelines back together.\nPower users often use text-based commands to manage their git repositories, but I prefer using GitHub Desktop, which an easy-to-use point-and-click interface.\nInstall GitHub Desktop\nInstall GitHub Desktop, then log in with your new GitHub credentials to set it up. These instructions are for the into-the-tidyverse tutorials, but it’s not too hard to figure out how to fork/clone other repositories using these instructions.\nIf this is your first time ever using GitHub Desktop, click on Clone a repository from the internet >> copy/paste psychNerdJae/into-the-tidyverse into the textbox >> Fetch origin. This creates a cloned copy of my repository onto your hard drive (scroll back up to review terminology if you’re getting lost).\nIf you’ve used GitHub Desktop before, you might have some git-managed repositories on your hard drive already. If that’s the case, click on Add >> Clone Repository >> URL >> copy/paste psychNerdJae/into-the-tidyverse into the textbox >> Fetch origin.\nYou can now access all of the latest workshop materials. If you start creating/modifying code or data, you’ll see those changes tracked through GitHub Desktop. Remember that the only changes that are saved are the ones you take a snapshot of by committing.\nYou’ll note that when you try to commit new changes for the first time, you’ll be prompted, “You don’t have write access to into-the-tidyverse. Want to create a fork?” Click that. When you try to push your commit, you’ll see some scary warning message that you don’t have write access to psychNerdJae/into-the-tidyverse. Go ahead and create a fork. In the next prompt, you’ll be asked how you’re planning on using this fork. Click on For my own purposes. Now, your changes are pushed to a forked copy of yourUserName/into-the-tidyverse, which runs in a parallel timeline to my original copy. This lets you play around with code as you’re learning to use R, without ever disturbing my original files.\nWhat if I make a change to my repository that you want to synchronize with your fork? For example, I could add more files to my repository as I develop new workshop materials, which you want to download. Since my repository is the original that your fork copies, my repository is known as the upstream (since it’s upstream in the timeline). You can always check to see if there are changes in the upstream by clicking on Current Branch and seeing whether there’s an option for upstream/main. If you don’t, that means there are no new commits in my version of the repository.\nNow that all of the materials live on your hard drive (in the cloned repository you forked from mine), you’re ready to learn!\nFile and folder structure\nThese instructions are specifically for into-the-tidyverse, but should apply to any other tutorials I write.\nFiles in the parent folder: Whenever you want to engage with these workshops, remember to double-click on into-the-tidyverse.Rproj first. This opens up a new R session (so that work you’re doing for this project doesn’t disturb whatever work you might be doing for other R projects).\nTutorials: This is where you can find the HTML files containing all tutorials. Each one features a self-contained lesson on a particular topic.\nSandbox: This is the only folder you should be modifying. You should never, ever, ever modify anything that’s in any other folder. Seriously, under most circumstances, there should be no reason for you to ever navigate into these directories or open these files. If you’re wanting to save scripts, plots, whatever, you should do it in the Sandbox. Make sure to follow these three simple rules to make sure everything goes smoothly:\nBasically, don’t touch anything in the Code and Data folders, and you’ll be alright. For those of you following along in realtime (i.e., I haven’t finished writing/developing all of the materials yet), this lets you avoid merge conflicts. In short, a merge conflict emerges when my version of the file looks different from your version of the same file. So if you take my code and you use it to play around by adding/deleting code, your file is now different from my file. When you try to “sync” new materials from my repository to your forked clone, this creates a merge conflict that you’re forced to resolve before you’re allowed to download my new materials.\nAny time you write new code, do it in this Sandbox folder. The point of a sandbox is that you can do anything you want, and the (potentially destructive) consequences of your actions will never leave the sandbox. This is important because I’m going to encourage you very, very, very strongly never to simply run the existing scripts in the Code folder (or equivalently, simply copy/pasting existing code). So when you’re typing code from scratch and need a place to save your scripts, save them in the Sandbox.\nOn that note, you should be typing code from scratch. This sandbox should be full of code, whether it works or not. You learn a lot from typing things from scratch, especially when you’re a beginner. This is because you’ll inevitably type things incorrectly when you do it from scratch, and then you’ll have to self-diagnose why your code doesn’t work. That is invaluable experience for learning how to code. And it will also help with your muscle memory. It takes virtually zero time for me to write a pipe (%>%) because I have typed thousands and thousands and thousands of pipes. You cannot get good at writing code quickly without building muscle memory. If you simply run existing code, or copy/paste existing code, you are hurting your own learning. There are no shortcuts to learning code. You must do it the hard way.\n\nCode: I’m providing all of the R Markdown code from the videos in the Code folder. These scripts are provided primarily for folks with visual impairments, who would find it useful to have the text for accessibility reasons. By and large, I do NOT want any other group of people looking at this code. Why? Because most of your learning occurs when you make (and correct) mistakes, and you can only make mistakes if you’re trying things out from scratch. You can’t make mistakes if you’re simply running someone else’s code, or just copy/pasting code.\nData: We will be using a diverse range of datasets from a variety of sources. There are times when it will make sense for you to directly download the data from the source (such as timeseries data on covid19, which is updated on a daily basis), but otherwise, the datasets will be provided in the Data folder. When applicable/available, the URL to the original dataset will be documented in the relevant scripts.\nOutput: Sometimes, there’ll be some kind of output I want to save to your hard drive (like a plot or table), so that you have a sense for what your output ought to look like. These will be saved in the Output folder. Anytime you have some output, you should save that to the Sandbox instead.\n…Now what?\nIf you’re ready to get started, go to the folder you’ve just created on your hard drive. From there, click into the Tutorials folder, and have fun with the first session!\n\n\n\n",
    "preview": {},
    "last_modified": "2021-10-28T15:19:23-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-21-grad-apps/",
    "title": "Grad School Application Advice",
    "description": {},
    "author": [],
    "date": "2019-01-24",
    "categories": [
      "psych",
      "grad school"
    ],
    "contents": "\n\nContents\nApplication timeline\nIdentifying potential programs\nReaching out to potential advisors\nGRE\nLetters of recommendation\nStatement of purpose\nFirst-round interviews\nIn-person interviews\nWaiting it out\n\nPersonal statements\n\nThis blog post was pulled from posts that were originally written on July 12, 2018 (timeline) and January 24, 2019 (personal statement). It was last updated on 2021-02-21 using R Markdown.\nApplication timeline\nThis is a brief timeline to help you figure out the timeline for applying to (research psychology) PhD programs. I originally wrote this up for a friend-of-a-friend who’s applying for a PhD this cycle. I’m sharing it here in the hopes that other folks might find this helpful as well!\nIdentifying potential programs\nThink about your favorite papers that were published the last few years: whose labs did they come from?\nWhat sort of research focus is essential to you? What sorts of research would you be open to exploring? What methodological skills do you want to learn?\nWhere do you want to live for the next 5-6 years?\nAdvisor qualities:\nHow hands-on/off do you want your advisor to be?\nDo you prefer PIs from a certain career stage?\nWhat’s your potential advisor’s reputation for kindness and productivity (in that order)?\nThis is where it’s good to consult with your current mentors, who can give you an insider’s perspective.\n\nReaching out to potential advisors\nSome people say that this is not important to do, but I personally recommend contacting potential advisors. After all, there’s no point in applying to somebody who’s not taking students (especially because it’s time-intensive and expensive to apply!).\nMy recommendation would be to send a short but thoughtful email that’s personalized for each PI. Mention why you’re interested in joining their lab, and find some way of indicating that you’ve done your homework (ask questions about one of their papers, suggest an idea for a research question that’s relevant to their ongoing projects, etc.). A good first impression goes a long way!\nI would reach out to potential advisors in early/mid September. This is around when they’d have a sense for whether they’ll be taking students.\nGRE\nIf you haven’t taken it yet, you should start thinking about the timeline in which you’ll be taking it.\nAccording to the company that administers it, “You can take the computer-delivered GRE General Test once every 21 days, up to five times within any continuous rolling 12-month period (365 days).”\nYou should also check how frequently the GRE is administered in your area, as this will put limits on when you can take it.\n\nBefore registering, you should also think about your timeline for studying.\nI felt pretty confident about the verbal and writing sections, so I focused all of my attention on the math section – I studied something like 2-3 hours every day for a month.\nAs with everything, your mileage may vary! Be sure to give yourself enough time to study, sit for the test once, then study for a second sitting if you feel like you need to.\n\nLetters of recommendation\nIdentify three people who can provide insightful comments about your…\nScientific knowledge\nResearch experience\nWork ethic\nAbility to succeed in a PhD program\n\nGive your recommenders about two months of advance notice. Assuming that most of your apps are due in December, that means asking by October at the latest.\nWhat’s really helpful for recommenders is if you can provide them with a spreadsheet listing every program they need to submit a letter to, as well as submission deadlines.\nBe sure to send reminder emails 1 month, 2 weeks, and 1 week before the deadline if they haven’t submitted by then. Find a way to express your gratitude.\nWriting a good rec takes a lot of time and thoughtfulness – find a meaningful way to express your gratitude, like sending a handwritten postcard in the mail or gifting a giftcard to their favorite coffee shop.\n\nStatement of purpose\nYou should start drafting your SoP at least two months before it’s due.\nAsk friends and mentors to provide feedback – I went through dozens of drafts based on other people’s suggestions, and it made my SoP stronger.\n\nThink carefully about what info you want to include. This statement is your main vehicle for expressing who you are, what you’re interested in, and why you’re the best candidate for your potential PI’s lab!\nThere’s lots of great advice online about how to write a SoP, so I won’t go into too much detail here.\nSee if you can get current grad students’ SoPs from when they applied, so that you have some templates to calibrate your expectations.\n\nFirst-round interviews\nYou may get requests starting in mid/late December to participate in some “informal” interviews via Skype. The purpose of these interviews is to allow the PI to get a sense for who you are, and whether they ought to invite you to an in-person interview.\nEven though they’re technically informal, you should do a lot of prep work! Read up on their papers, familiarize yourself with their current lines of research, get ready to answer questions about yourself and your intellectual interests, etc.\nDon’t freak out if you don’t get a first-round interview. I was invited to some in-person interviews even though I was never approached for a first-round interview. Some PIs like to do first-round interviews, and others don’t.\nIn-person interviews\nMy earliest interview was in mid-January, but interviews typically run anywhere from late January through mid-March.\nWaiting it out\nNo good advice here, other than to find ways to keep yourself from going crazy with anticipation. (:\nPersonal statements\nAdapted from an email I sent to a friend who’s applying to PhD programs in psychology:\nWhen your prospective advisor reads your personal statement, they’re ultimately trying to evaluate whether you’ll be a successful and productive member of their lab. Before you start writing a single word of your personal statement, take some time to think deeply about the kinds of questions you’d have for an applicant if you were a lab director looking for a new student. The art of writing is telling an engaging and eloquent story about your trajectory through academia. The science of writing is addressing how your trajectory has prepared you to be an outstanding PhD student. Neither is sufficient; you need both!\nIn case you’re feeling stuck, here are examples of questions that you might want to answer in your personal statement:\nWhat got you interested in psychology to begin with? What steps have you taken to address these interests? How have your interests evolved over time as a function of the experiences you’ve had?\nWhat academic/research experiences have you had, and how do they qualify you to be a PhD student?\nHow deeply were you involved in research projects? How independently can you work? What skills did you learn? How comfortable are you working with data? To what extent do you understand both the theoretical reasons for doing the research, and how the design/results of the research address those theoretical questions?\nOf all the programs/advisors you could have applied to, why this one? What does this school have that other schools don’t? How deeply have you thought about your potential fit here? Are there specific research directions you might like to pursue with this particular advisor?\n\n\n\n",
    "preview": {},
    "last_modified": "2021-10-28T15:19:23-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2018-02-06-influential-women-poc/",
    "title": "Influential Living Psychologists: Women & POC",
    "description": {},
    "author": [],
    "date": "2018-02-06",
    "categories": [
      "psych"
    ],
    "contents": "\nThis blog post was originally written on February 6, 2018. It was last updated on 2021-02-21 using R Markdown.\nAbout a month ago, a website called “The Best Schools” published a list entitled “The 50 Most Influential Living Psychologists in the World.” Readers immediately noticed that there was a disturbing lack of Martian psychologists included on this list (after all, they didn’t specify that “in the world” had to refer to Earth!).\nFar less amusing was the number of women and people-of-color (POC) who were chosen to represent “influential” living psychologists. By my count, 78% of those listed were male, and 100% of them were white. I want to stress that all of the individuals included on that list are brilliant scientists who have certainly made important impacts on the field - it is not my goal to diminish their accomplishments. However, as a POC psychologist-in-training, I was inspired to crowdsource a new list of influential living psychologists, one that highlighted the lives and accomplishments of important female and POC figures who had been previously overlooked. In other words, for those of us who look at such lists and think, “Is there room in this field for people who look like me?”, my goal is to expand the record, not to correct it.\nI want to caveat that this list should not be taken as any sort of “big-t” Truth. It reflects the (undoubtedly idiosyncratic) inclinations of a select group of twitter users. (As a concrete example, I observed a few instances in which individuals’ nominations consisted exclusively of professors from their own affiliated university!) But I do believe that it captures some amount of “little-t” truth, and it gives us hope for a future in which individuals from historically-marginalized backgrounds are increasingly well-represented in our science.\nIn total, there were a stunning 396 unique individuals who received nominations. Most of them had not been previously included on the list published by “The Best Schools.” Although I had originally intended to identify the top 50, my current list consists of 71 individuals due to ties (and I’d rather err on the side of celebrating more people’s accomplishments than fewer!). They are listed below in alphabetical order. Descriptions were pulled and lightly edited from nominees’ personal websites and/or Wikipedia.\nRenée Baillargeon\nDr. Baillargeon’s research focuses on early causal reasoning in four core domains: physical reasoning, psychological reasoning, biological reasoning, and sociomoral reasoning. She assumes that each domain is equipped with a skeletal explanatory framework that enables infants to reason and learn about events in the domain.\nMahzarin Banaji\nDr. Banaji studies thinking and feeling as they unfold in social context, with a focus on mental systems that operate in implicit or unconscious mode. She studies social attitudes and beliefs in adults and children, especially those that have roots in group membership. She explores the implications of her work for questions of individual responsibility and social justice in democratic societies.\nLisa Feldman Barrett\nDr. Barrett’s theory of constructed emotion hypothesizes that “anger,” “sadness,” “fear,” and similar mental events are not basic building blocks in the mind, but instead are mental events that result from the dynamic interplay of more basic brain networks that are not themselves specific to emotion. Her lab studies how emotions emerge from prediction signals in the brain that function as concepts to categorize incoming sensory inputs from the body and the surrounding context, constructing experiences and perceptions of emotion.\nDorothy Bishop\nDr. Bishop researches language impairments in children. In some cases, language difficulties have an obvious cause, such as hearing loss or a condition such as Down’s syndrome. In other cases, children have particular difficulty learning to talk or understand language for no obvious reason. Professor Bishop has studied children with ‘specific language impairment’ or SLI, who make up around 3% of the population but tend to be neglected by researchers. Using twin studies, she has investigated the genetic component to these disorders, and has worked with molecular geneticists to find out which genes are involved.\nSarah-Jayne Blakemore\nDr. Blakemore’s research focuses on neurocognitive development in typically developing adolescents. She is particularly interested in the development of the social brain, as well as how the brain matures to enable cognitive control, a collection of brain processes that guide thought and behaviour in accordance with internally generated goals or plans.\nMarilynn Brewer\nDr. Brewer’s major interests include (1) social cognition, the perception and cognitive representation of individual persons and person “types”; (2) intergroup relations, especially the study of ingroup biases and the effects of contact between groups on intergroup acceptance; and (3) social identities and the self-concept.\nSusan Carey\nDr. Carey’s research concerns the development of concepts in the child and adult (i.e., over ontogenesis), and the cultural construction of concepts over history. Her research is informed by insights from philosophical analyses of concepts, historical analyses of conceptual change in science, and experimental studies of human infants, young children and adults, and of non-human primates.\nLaura Carstensen\nDr. Carstensen is the founding director of the Stanford Center on Longevity, which explores innovative ways to solve the problems of people over 50 while improving the well-being of people of all ages. She is best known in academia for socioemotional selectivity theory, a life-span theory of motivation.\nBJ Casey\nDr. Casey is a world leader in human neuroimaging and its use in typical and atypical development. She is a world leader in human neuroimaging and its use in typical and atypical development. She examines developmental transitions across the life span, especially during the period of adolescence. Her work is grounded in translational studies from genetically altered mice to human patients, developing models for several mental health problems that affect millions of young people today.\nMargaret Clark\nDr. Clark’s research focuses on optimal intra- and interpersonal functioning close relationships, the social functions of emotion, and the intersection of those two areas. She is interested in the normative nature of interpersonal processes as they occur within family relationships, friendships, and romantic relationships and in how the norms that apply to such relationships differ from those that apply to relating to acquaintances and business partners.\nLeda Cosmides\nDr. Cosmides is best known for her work in pioneering the new field of evolutionary psychology, which weaves together cognitive science, human evolution, hunter gatherer studies, neuroscience, psychology and evolutionary biology, in an attempt to understand and map the human mind and brain.\nMichelle Craske\nDr. Craske has published extensively in the area of fear, anxiety, and depression. In addition to over 392 research articles, she has written academic books on the topics of the etiology and treatment of anxiety disorders, gender differences in anxiety, translation from the basic science of fear learning to the understanding and treating of phobias, and principles and practice of cognitive behavioral therapy, as well as several self-help books and therapist guides.\nWilliam E. Cross, Jr.\nDr. Cross is one of America’s leading theorists and researchers on black identity development and racial-ethnic identity development. His text, Shades of Black, is a classic in the field. He was swept-up by the Black Consciousness Movement of the 1960s and 1970s. Subsequently, he constructed Nigrescence Theory to explicate the identity change process linked to social movement dynamics.\nNilanjana Dasgupta\nDr. Dasgupta’s research challenges the assumption that implicit prejudice and stereotypes are immutable and identifies circumstances under which they can be changed. Some of her projects identify conditions that reduce implicit bias while other projects identify conditions that magnify implicit bias. Some projects focus on changing implicit stereotypes about outgroups whereas others focus on changing the impact of ingroup stereotypes on individuals’ own self-concept and life decisions.\nPatricia Devine\nDr. Devine is interested in how people manage the intrapersonal and interpersonal challenges associated with prejudice in our contemporary society. One main focus for recent work focused on the sources of motivation, internal and external, for responding without prejudice and the unique challenges these alternate sources of motivation create for managing the interpersonal aspects of intergroup relations.\nAdele Diamond\nDr. Adele Diamond is one of the pioneers in the field of Developmental Cognitive Neuroscience, and researches executive functions which depend on prefrontal cortex (PFC) and interrelated brain regions. Executive functions include ‘thinking outside the box’ (cognitive flexibility), mentally relating ideas and facts (working memory), and giving considered responses rather than impulsive ones, resisting temptations and staying focused (inhibitory control, including selective attention).\nLisa Diamond\nDr. Lisa Diamond studies the development and expression of sexual identity and orientation over the life course. She is particularly interested in investigating the potential underpinnings of different subtypes of sexual-minority experience (such as stable versus fluctuating patterns of attraction and exclusive versus bisexual patterns), and examining how these patterns relate to tonic levels and phasic changes in gonadal hormones, oxytocin, HPA axis activity, and autonomic nervous system activity.\nAngela Duckworth\nDr. Duckworth’s research focuses on two traits that predict achievement: grit and self-control. Grit is the tendency to sustain interest in and effort toward very long-term goals. Self-control is the voluntary regulation of impulses in the presence of momentarily gratifying temptations. On average, individuals who are gritty are more self-controlled, but the correlation between these two traits is not perfect: Some individuals are paragons of grit but not self-control, and some exceptionally well-regulated individuals are not especially gritty.\nCarol Dweck\nDr. Dweck’s work bridges developmental psychology, social psychology, and personality psychology, and examines the self-conceptions people use to structure the self and guide their behavior. Her research looks at the origins of these self-conceptions, their role in motivation and self-regulation, and their impact on achievement and interpersonal processes.\nAlice Eagly\nDr. Eagly is known for her research on the psychology of gender, especially sex differences and similarities in leadership, prosocial behavior, aggression, partner preferences, and sociopolitical attitudes. She has also published on the content of stereotypes, and has proposed social role theory as a theory of sex differences and similarities, and of the origins of sex differences in social behavior. She has also researched attitudinal selectivity in information processing.\nJennifer Eberhardt\nDr. Eberhardt investigates the consequences of the psychological association between race and crime. Through interdisciplinary collaborations and a wide ranging array of methods—from laboratory studies to novel field experiments—Dr. Eberhardt has revealed the startling, and often dispiriting, extent to which racial imagery and judgments suffuse our culture and society, and in particular shape actions and outcomes within the domain of criminal justice.\nJacquelynne Eccles\nDr. Eccles has conducted research on a wide variety of topics including gender-role socialization, teacher expectancies, classroom influences on student motivation, and social development in the family and school context. She has made seminal contributions to the study of achievement-related decisions and development. Most notably, her expectancy-value theory of motivation and her concept of stage-environment have served as perhaps the most dominant models of achievement during the school years, contributing to extensive research and reform efforts to improve the nature of secondary school transitions.\nPhoebe Ellsworth\nDr. Ellsworth is noted for her work in law and psychology, where she has conducted research on jury behavior and decision making, public opinion and the death penalty, and eyewitness identification. She is also known for her research in emotion, including facial emotions, cognition and emotion, and interpretation of emotion. Dr. Ellsworth is known for her contributions to appraisal theory, emotions and culture, challenges of emotion and language, and for her writing on William James. In much of her research, Dr. Ellsworth has intertwined an interest in cultural differences.\nMartha Farah\nDr. Farah is a cognitive neuroscientist who works on problems at the interface of neuroscience and society. These include the effects of childhood poverty on brain development, the expanding use of neuropsychiatric medications by healthy people for brain enhancement, novel uses of brain imaging (e.g. legal, diagnostic and educational contexts), and the many ways in which neuroscience is changing the way we think of ourselves as physical, mental, moral and spiritual beings.\nSusan Fiske\nDr. Fiske’s research addresses how stereotyping, prejudice, and discrimination are encouraged or discouraged by social relationships, such as cooperation, competition, and power. In laboratory studies, she examines how a variety of relationships affect people forming impressions of others. Society’s cultural stereotypes and prejudice also depend on relationships of power and interdependence. Group status and competition affect how groups are (dis)liked and (dis)respected. In cultural surveys, she examines the content of group stereotypes based on race, gender, age, (dis)ability, income, and more, finding patterns in the ways that society views various groups.\nUta Frith\nDr. Frith is best known for her research on autism spectrum disorders. Throughout her career, she has been developing a neuro-cognitive approach to developmental disorders, and has specifically investigated specific cognitive processes and their failure in autism and dyslexia. Her aim is to discover the underlying cognitive causes of these disorders and to link them to behavioural symptoms as well as to brain systems. She aims to make this research relevant to the education of people with development disorders and to contribute to a better quality of their everyday life.\nSusan Gelman\nDr. Gelman’s research investigates the development of concepts and language in childhood. Research topics include: categorization and inductive reasoning; psychological essentialism; generic concepts and generic language; social categories (including gender, race, traits, and human difference); ownership, authenticity, and object history; parent-child conversations; and semantic development.\nDedre Gentner\nDr. Gentner is a prominent researcher in the study of analogical reasoning, and has published extensively on: the semantics of word classes and their effects on acquisition of language; structure-mapping in similarity; similarity in long-term memory versus similarity in reasoning; comparison processes in learning and development; relational language and relational cognition; analogical processes in the history of science; comparison processes in education; and mental models.\nMorton Gernsbacher\nDr. Gernsbacher’s research focuses on the cognitive processes and mechanisms that underlie language comprehension. She has challenged the view that language processing depends upon language-specific mechanisms, proposing instead that it draws on general cognitive processes such as working memory and pattern recognition. During recent years, her research has focused on the cognitive and neurological processes of people with autism. She has posited that the speech difficulties associated with autism stem from motor planning challenges, not from intellectual limitations or social impairment.\nLila Gleitman\nDr. Gleitman’s work has concerned the mental lexicon and its interface with syntax, language acquisition, and the relation between language and thought. She is an internationally renowned expert on language acquisition and developmental psycholinguistics, focusing on children’s learning of their first language.\nPhillip Goff\nDr. Goff is the co-founder and president of the Center for Policing Equity, and an expert in contemporary forms of racial bias and discrimination, as well as the intersections of race and gender. Dr. Goff conducts work exploring the ways in which racial prejudice is not a necessary precondition for racial discrimination. That is, despite the normative view of racial discrimination—that it stems from prejudiced explicit or implicit attitudes—his research demonstrates that situational factors facilitate racially unequal outcomes.\nAdele Goldberg\nDr. Goldberg’s research focus is on the psychology of language, including theoretical and experimental aspects of grammar and its representation, acquisition of form-function correspondences, and syntactic priming. Her works aim to illuminate parallels between language and other cognitive processes. She is best known for her work on constructions, statistical preemption, the creation and development of the artificial construction learning paradigm, and the suggestion that both statistics (particularly in the form of skewed input) and the functions of constructions play an important role in learning.\nSusan Goldin-Meadow\nDr. Goldin-Meadow began her studies exploring whether children who lack a (usable) model for language can nevertheless create a language with their hands. She has found that deaf children whose profound hearing losses prevent them from learning the speech than surrounds them, and whose hearing parents have not exposed them to sign, invent gesture systems which are structured in language-like ways. This interest led to her current work on the gestures that accompany speech in hearing individuals. She has found that gesture can convey substantive information – information that is often not expressed in the speech it accompanies.\nAlison Gopnik\nDr. Gopnik’s research explores how young children come to know about the world around them. The work is informed by the “theory theory” – the idea that children develop and change intuitive theories of the world in much the way that scientists do. Most recently, she has been concentrating on young children’s causal knowledge and causal learning across domains, including physical, biological and psychological knowledge. In collaboration with computer scientists, she is using the Bayes Net formalism to help explain how children are able to learn causal structure from patterns of data, and she has demonstrated that young children have much more powerful causal learning mechanisms than was previously supposed.\nJanet Hyde\nDr. Hyde’s research falls in the areas of psychology of women, human sexuality, and gender-role development. One current research project focuses on the emergence of gender differences in depression in adolescence, using data from our longitudinal project, The Wisconsin Study of Families and Work. Another current project, funded by the National Science Foundation, uses the technique of meta-analysis to synthesize available data on gender differences and similarities in mathematics performance. Another current project evaluates whether single-sex schooling actually produces better outcomes than coeducational schooling.\nOlcay Imamoğlu\nDr. Imamoğlu has conducted research focusing on: the interplay between self, relationships, and well-being across cultures; a new model of self-construction: The Balanced Integration-Differentiation (BID) Model; gender, marital relations, and satisfaction across cultures; the social psychology of older adults, and environmental assessment; and social cognition and affect.\nMarcia Johnson\nDr. Johnson uses cognitive behavioral and neuroimaging (fMRI) techniques to investigate the nature of human cognition and memory. She has published research on topics such as: a component process analysis of memory and cognition; reality monitoring/source monitoring; the relation between emotion and cognition; the “self” in cognition; and changes in cognition associated with aging.\nNancy Kanwisher\nDr. Kanwisher studies the functional organization of the human brain as a window into the architecture of the mind. Over the last 20 years, her lab has played a central role in the identification of several dozen regions of the cortex in humans that are engaged in particular components of perception and cognition. Many of these regions are very specifically engaged in a single mental function such as perceiving faces, places, bodies, or words, or understanding the meanings of sentences or the mental states of others.\nShinobu Kitayama\nDr. Kitayama’s research focuses on cultural variations in self, cognition, emotion, and motivation. Over the last two decades, he has used a variety of experimental methods to document a wide array of East-West differences in psychological processes. His more recent work has explored regional, social class, as well as age differences and similarities in psychological tendencies to understand their socio-cultural underpinnings. He has also pioneered the use of neuroscience measures such as fMRI and EEG in the investigation of the dynamic, recursive interaction between culture and the brain, thereby contributing to the emerging field of cultural neuroscience.\nMarta Kutas\nDr. Kutas studies how meaning is organized, accessed, and constructed in the brain, focusing specifically on understanding how context shapes language and memory processing. Her studies track these cognitive and neural processes in both healthy and clinical individuals across the adult lifespan, primarily by assessing patterns of brainwaves recorded at the scalp as well as reaction times to various visual and auditory stimuli.\nEllen Langer\nDr. Langer is a social psychologist and the first female professor to gain tenure in the Psychology Department at Harvard University. She has been described as the “mother of mindfulness” and has written extensively on the illusion of control, mindful aging, stress, decision-making, and health. Her recent work is concerned with the interaction of mindfulness and health, business, and education.\nElizabeth Loftus\nDr. Loftus studies human memory. Her experiments reveal how memories can be changed by things that we are told. Facts, ideas, suggestions and other post-event information can modify our memories. The legal field, so reliant on memories, has been a significant application of the memory research. Loftus is also interested in psychology and law, more generally.\nAsifa Majid\nDr. Majid investigates the nature of categories and concepts in language, in non-linguistic perception and cognition, and the relationship between them. She adopts a large-scale cross-cultural approach in order to establish which aspects of categorisation are fundamentally shared, and which language-specific. Using an interdisciplinary approach, she has researched domains such as space, event representation and more recently the language of perception.\nBrenda Major\nDr. Major is an international expert in the psychology of stigma and how people perceive and cope with stigma and discrimination. A core theme of her work is psychological resilience – how people maintain their sense of self-esteem, psychological well-being and physical health despite exposure to discrimination, negative life events, and adversity.\nIvana Markova\nDr. Markova’s main theoretical research interests are the ontology and epistemology of theory in social psychology, and the interdependence between social thinking, dialogue and semiotics. Empirical research concerns social representations of democracy, individualism and responsibility in post communist Europe and the study of dialogues between people with impaired speech and their partners.\nHazel Markus\nDr. Markus’ research focuses on the role of self in regulating behavior and on the ways in which the social world shapes the self. Her work examines how cultures, including those of nation or region of origin, gender, social class, race, ethnicity, religion, and occupation, shape thought, feeling, and action. She is the co-director of SPARQ (Social Psychological Answers to Real-world Questions) at Stanford University.\nWendy Berry Mendes\nDr. Mendes researches embodiment: how emotions, thoughts, and intentions are experienced in the body and how bodily responses shape and influence thoughts, behaviors, and emotions. Current research areas include coping with stigma and discrimination, dyadic intergroup interactions, affect contagion, mind-body relations across the life course, influence of emotional labeling on emotional experience and effects of stress on decision-making.\nBrenda Milner\nDr. Milner discovered that Patient HM could learn and remember particular types of tasks, and that his memories of the past before the operation were seemingly intact. With this revelation, she established that people have multiple memory systems, governing different activities like language or motor skills, opening the way for a greater understanding of how the brain works. Dr. Milner also conducted much of the early work that established how the different hemispheres of the brains interact, which has had an enormous impact on understanding cognitive learning, language, sensations and emotions.\nElissa Newport\nDr. Newport’s primary research interest is in the acquisition of language by young children, in the relationship between language acquisition and language structure, and in the acquisition of language by children and adults after damage to the brain. She also studies maturational effects on language learning, comparing children to adults as first and second language learners, and asking why children perform better than adults in language acquisition.\nBetsy Levy Paluck\nDr. Paluck’s research is motivated by two ideas: The first idea is that social psychological theory offers potentially useful tools for changing society in constructive ways. The second idea is that studying attempts to change society is one of the most fruitful ways to develop and assess social psychological theory. Much of her work has focused on prejudice and conflict reduction, using large-scale field experiments to test theoretically driven interventions.\nElizabeth Phelps\nDr. Phelps’ research examines the cognitive neuroscience of emotion, learning and memory. She is particularly interested in extending animal models of emotional learning to human behavior, understanding emotion’s influence in episodic memory, studying the impact of emotion on perception, attention and expression, and extending the basic mechanisms of emotional learning to social behavior, decision making and economics.\nMolly Potter\nDr. Potter’s research has focused on very short-term memory for pictures, words, and scenes, and she has received international acclaim for introducing the RSVP paradigm. RSVP stands for Rapid Serial Visual Presentation, and the method has been harnessed to examine the earliest levels of information processing in humans.\nValerie Purdie Greenaway\nDr. Purdie Greenaway’s research integrates existing knowledge of human biological systems with intergroup (“us” vs. “them”) dynamics. Specifically, her research focuses on neurophysiologic pathways involved in stereotype threat; dialogues about past racial injustice, implicit power, and activation of the sympathetic nervous system; and incorporating biomarkers related to stress to understand physiological mechanisms linking concealment of a stigmatized identity and psychological distress and dysregulated eating.\nV.S. Ramachandran\nDr. Ramachandran is Director of the Center for Brain and Cognition, which has two distinct agendas—a practical one and a theoretical one. The practical goal is to help develop new therapeutic approaches for the treatment of neurological and psychiatric patients, e.g., chronic pain, stroke, anorexia and childhood autism. The theoretical agenda is to understand the neural basis of human behavior: the question of how the activity of the human brain gives rise to all the richness of our conscious experience.\nJennifer Richeson\nDr. Richeson’s research examines multiple psychological phenomena related to cultural diversity. Her work generally concerns the ways in which sociocultural group memberships such as race, gender, and socio-economic status impact the way people think, feel, and behave, especially during interactions with members of different sociocultural groups. Through her teaching and research, Richeson hopes to contribute to a better understanding of intergroup relations, including how best to foster culturally diverse environments that are cohesive.\nLaurie Santos\nDr. Santos explores the evolutionary origins of the human mind by comparing the cognitive abilities of human and non-human primates. Her studies focus on a number of different primate species and incorporate methodologies from cognitive development and cognitive neuroscience. Her research examines the following broad questions: what domains of knowledge are unique to the human mind? Given that human infants and non-human primates both lack language, what similarities and differences do we see in the expression of non-linguistic domains of knowledge?\nRebecca Saxe\nDr. Saxe’s research is motivated by big questions: How does the human brain ‒ an electrical and biological machine ‒ construct abstract thoughts? What aspects of our brains and minds are universal, shared by all humans, and how much is specific to a culture, or unique to an individual? How do children’s brains change as they grow up? How do developmental disorders, like autism, affect brain development? She often asks these questions in the domain of social cognition: how people think about people.\nDenise Sekaquaptewa\nDr. Sekaquaptewa’s experimental research program focuses on implicit stereotyping, prejudice, stereotype threat, and effects of category salience on test performance and academic motivation. Her current projects include studies of how environmental factors influence women students in math and science, and how stereotypes affect interracial communication.\nJames Sidanius\nDr. Sidanius’ primary research interests include the interface between political ideology and cognitive functioning, the political psychology of gender, group conflict, institutional discrimination and the evolutionary psychology of intergroup prejudice. His most important theoretical contribution to date is the development of social dominance theory, a general model of the development and maintenance of group-based social hierarchy and social oppression.\nTania Singer\nDr. Singer’s research focuses on the developmental, neuronal, and hormonal mechanisms underlying human social behavior, and she is recognised as a world expert on empathy. Her work focuses on social cognition, social moral emotions such as empathy, compassion, envy and fairness, social decision making, and communication. She is interested in the determinants of cooperation and prosocial behavior as well as the breakdown of cooperation and the emergence of selfish behavior.\nLinda Smith\nDr. Smith’s central theoretical question is the study of developmental process and mechanisms of change. Her work focuses on early changes in perception, language, and action and how those changes in these areas support each other particularly around the age that children break into language. Her research takes a systems approach, seeking to understand how multiple components interact over nested time scales and levels of analysis and how, in so doing, they yield an individual’s developmental path.\nElizabeth Spelke\nDr. Spelke’s research focuses on the sources of uniquely human cognitive capacities, including the capacity for formal mathematics, the capacity for constructing and using symbolic representations such as maps, the capacity for developing comprehensive taxonomies of objects, and the capacity for reasoning about other humans and their social groups. Dr. Spelke studies these capacities by investigating their origins and growth in human infants and children, by considering human cognition in relation to the capacities of nonhuman primates, and by comparing the capacities of humans from diverse cultures.\nSanjay Srivastava\nDr. Srivastava studies the dynamics of personality in social contexts. He defines “personality” broadly to include traits, identities, roles, emotions, and motivations, and studies personality in many social contexts, including among strangers, in couples, in small groups, and in online societies. He uses a variety of research methods, including laboratory experiments and observations, ecological assessments, longitudinal studies, surveys, and both laboratory-based and automated analyses of digital data, including “big data” methods for large-scale research in social media.\nClaude Steele\nDr. Steele is best known for his work on stereotype threat and its application to explain real-world problems such as the underperformance of female students in mathematics and science classes as well as black students in academic contexts. Dr. Steele has spearheaded many successful interventions aimed at reducing the negative effects of stereotype threat, including how to provide critical feedback effectively to a student under the effects of stereotype threat, and how teacher practices can foster a feeling of identity safety.\nDerald Wing Sue\nDr. Sue is a pioneer in the field of multicultural psychology, multicultural education, multicultural counseling and therapy, and the psychology of racism/antiracism. He has performed extensive multicultural research and writing in psychology and education, and his theories and concepts have paved the way for a generation of younger scholars interested in issues of minority mental health and multicultural psychology.\nShelley Taylor\nDr. Taylor is well known for her work showing that people tend to hold positive illusions of themselves and that it can be healthy to do so, the mechanisms by which stress affects health, and the influence that early experiences can have on how our bodies process stress. Together with her student, Dr. Susan Fiske, she worked to expand the nascent field of social cognition, which examines the ways people think about other people and the influences on those thoughts.\nAnne Treisman\nDr. Treisman researches visual attention, object perception, and memory. One of her most influential ideas is the feature integration theory of attention, a two-stage model of visual object perception. During her long career, Dr. Treisman has experimentally and theoretically defined the issue of how information is selected and integrated to form meaningful objects that guide human thought and action.\nBarbara Tversky\nDr. Tversky is a leading authority in the areas of visual-spatial reasoning and collaborative cognition. Her specific research interests include spatial language and thinking, event perception and cognition, diagram production and comprehension, gesture, diagram, and language in thinking and in communication, diagrams for discovery and design, creativity, design, art, thinking tools, teaching tools, and design tools.\nLeslie Ungerleider\nDr. Ungerleider is the Chief of the NIMH Section on Neurocircuitry, which is devoted to establishing the links between neural structure and cognitive function, especially in the visual modality. Her work on visual attention and perception has shown that in a typical scene many different objects compete for neural representation due to the limited processing capacity of the visual system. Her recent work has shown that, similar to the processing of other stimulus categories, the processing of stimuli with emotional valence is under top-down control, requiring attentional resources.\nSimine Vazire\nDr. Vazire’s research examines people’s self-knowledge of their own personality and behavior. Her goal is to measure how people differ from one another not just at the trait level but also in their patterns of fluctuations across different roles and situations. She examines how much insight people have about their own and close others’ traits and patterns. She is also interested in how personality and social relationships (e.g., friendship) influence well-being. Finally, she is interested in research methods, and factors that affect the validity and replicability of psychological research.\nJanet Werker\nDr. Werker’s research focuses on understanding the roots of language acquisition by studying speech perception in infancy, the mechanisms by which native speech sound categories are acquired, and how speech perception supports early word learning. She studies infants growing up in different language environments, infants growing up bilingual, and infants with, or at risk for, developmental disabilities. Adult studies focus on speech perception and lexical processing of both spoken language and visual speech. More recently, she has also begun exploring the nature of critical periods, and epigenetic processes that underlie developmental change.\nSome of the individuals who were nominated have recently passed, and are memorialized here:\nNalini Ambady\nDr. Ambady was a leading expert on nonverbal behavior and interpersonal perception. Her research found that humans perceive nonverbal cues in response to novel people or situations, and that the information gleaned from an instant impression is often as powerful as information gleaned by getting to know a situation or person over a longer period of time. She and Robert Rosenthal coined the term “thin slices” to refer to such instantaneous non-verbal cues. Dr. Ambady died on October 28, 2013 after a long struggle with leukemia.\nÇiğdem Kağıtçıbaşı\nDr. Kağıtçıbaşı was known for her belief that Western psychology could not account for the whole of humanity, and that it needed to recognise the experiences of those living in non-Western cultures and geographies. She was also passionate about the field of child development, and her work on parent education programs eventually led to the establishment of the Mother Child Education Foundation (MOCEP), which had the goal of implementing early childhood education, family literacy, functional adult literacy and women’s support programs.\nAnnette Karmiloff-Smith\nDr. Karmiloff-Smith was an expert in developmental disorders, with a particular interest in Williams syndrome. She viewed modularization as a process that results in (rather than begins with) successively more developed and modularized knowledge representations. She also argued for the importance of studying developmental disorders, not as broken processes, but as developmental trajectories that take different paths from the typical and, as a result, provide unique insights into the mechanisms that foster developmental change in all children.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-10-28T15:19:23-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2017-09-16-grad-app-thoughts/",
    "title": "Thoughts as I begin the grad school application process",
    "description": {},
    "author": [],
    "date": "2017-09-16",
    "categories": [
      "grad school"
    ],
    "contents": "\nThis blog post was originally written on September 16, 2017. It was last updated on 2021-02-21 using R Markdown.\nAs much as I would like to continue to ignore that it’s mid-September, I can no longer maintain the illusion that I’ve got a great deal of time left before grad school and grant applications are due. When it comes to thinking about my future, I am planful to a fault, and though I have learned to be less rigid in my thinking, it is not my automatic response to be relaxed about impending risky decisions. Tomes have been written about impostor syndrome and social comparison and anxiety and every other thing that afflicts academics, but writing posts like this help me reaffirm my values. Here are some thoughts I’m having as I (properly!) begin the grad school application process, mostly in the form of platitudes:\nEveryone you admire was once where you are now. They’ve felt (and even among the prestigious scientists I know, continue to feel) unsure of themselves. They’ve made mistakes, and maybe even catastrophic ones. They’ve questioned their direction, or aptitude, or competence. They’ve experienced failure and disappointment and frustration and regret. They’ve lost perspective and have cried over silly things, which later turned out to be relatively inconsequential. What’s the difference between you and those scientists you admire? Many, many years of relentless training and learning and building up resilience.\nThere isn’t one right way to take care of yourself. It used to drive me crazy when people tell me to practice self-care because I had no idea what that meant. It does not make me feel good to sit around and do nothing. The notion that I take a bubble bath, drink wine, and watch Netflix to unwind is actually stress-inducing to me; I need to funnel my energy into some form of work that I find meaningful. Sometimes, that means wrapping up work-related loose ends so that I can free up my mind to think about more important things. Other times, it means doing chores that are mindless but necessary: vacuuming, doing laundry, running errands, meal prep, etc. As a proper demonstration of how nerdy I am, sometimes self-care looks like reading newly-published articles and getting inspired about follow-ups I might want to conduct, which I find invigorating. People who aren’t incorrigible nerds look at me and worry that I’m a workaholic. Though I appreciate their concern and understand why they might believe that, I’ve found a balance that works for me, at least for now. The point isn’t that you engage in rituals or follow other people’s rules about self-care. The whole point is that you find some way of taking care of yourself, and only you know what that looks like.\nOn the other hand, there are many wrong ways to take care of yourself. It’s one thing to go out to the bar with friends at the end of a long week; it’s quite another to use alcohol to manage stress on a daily basis. There’s a difference between managing and coping. If you ever hear a nagging voice in the back of your head, or if friends tell you that they’re concerned for you, take that as a serious sign to stop and self-evaluate. If you need help, there’s nothing shameful or burdensome about asking for help.\nIn fact, that last thing I wrote is important enough to bear repeating: if you need help, there’s nothing shameful or burdensome about asking for help. If you knew that your friend was feeling what you’re feeling now, would you want them to keep it to themselves?\nIt is exhausting pretending to be someone who isn’t you, and people can usually see through it anyways. People generally like authenticity. If you’re hanging around people who don’t appreciate you for being you, maybe you need to find different people to hang out with.\nListen to your emotions. Oftentimes, when I’m stressed out, it’s not being fueled by ‘stress’ per se. Instead, for me, ‘stress’ is a cognitive label I apply to the emotional experience of feeling fearful: afraid of the consequences of not meeting a deadline, or of disappointing someone, or of uncertainty looming on the horizon. At any rate, your emotions are usually trying to cue you into the fact that you might not be doing too great.\nFigure out what your fears are and confront them head-on. This works for me, anyways. I was once stressed out about an analysis I was performing. I realized that the reason I was stressed out was because I was afraid that: 1) my inability to perform the analysis meant that I was an idiot; 2) I was doing the entire analysis wrong, and didn’t even know enough about what I was doing to figure out why it might be wrong; 3) in the worst-case scenario, nobody else would catch any mistakes I made, and then we’d have to retract a paper once a reader figured out that the analyses were done incorrectly, and then I would besmirch the reputations of my collaborators and advisors. I immediately stopped working on the analysis and started to read up on the underlying theory of the analysis I was performing. Though it took me a few days to gain a sense of familiarity with the theory, having a little bit of statistical knowledge both put my mind at ease and made me a smarter scientist. I am firmly of the opinion that no good can come of ignoring things you’re afraid of.\nMaking mistakes means that you’re learning; failure means you’re trying. I get caught up on this a lot. I don’t like making mistakes, and I absolutely hate feeling like a failure. But there is nothing bad about learning or trying, and it is impossible to do either without making mistakes and failing. This is something I would do well to remind myself more often.\nYou don’t make plans to follow through with them; you make plans to think about your values, direction, and aspirations. Very little of my life goes according to plan, which is a good thing. My life would be utterly tepid if my harebrained schemes actually worked. I sometimes make the mistake of thinking that the plans I devise are intrinsically valuable, and that the point of making plans is to follow them. Rather, I think making plans forces you to decide (at least internally) what your values are, which determines the direction you take (but importantly, not the path!), and this tells you something about your hopes and aspirations. So when you’re faced with reality, and your carefully-constructed plans fall to bits, you still have a foundation to stand on: you know who you are, what you want, and where you want to go.\nYou are constantly creating yourself. Every choice either brings you closer to (or pushes you further away from) the person you want to be. In the grand scheme of all things that exist, there’s very little that we can bring under our direct control. If I’m on a sailboat, there’s not much I can do if there’s no wind. However, in the meantime, I can put up my sails and prepare for incoming gusts. This is how I think about choices: you can’t control your life, but you can push the odds in your favor. In the process of doing this, you’re incrementally crafting yourself into the person you want to be.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-10-28T15:19:23-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2017-08-16-psychblog-and-jelly/",
    "title": "PsychBlog & Jelly",
    "description": {},
    "author": [],
    "date": "2017-08-16",
    "categories": [
      "meta"
    ],
    "contents": "\n\nContents\nWhat is PsychBlog & Jelly?\nWhat can I expect to see on PsychBlog & Jelly?\nWhy PsychBlog & Jelly?\n\nThis blog post was originally written on August 16, 2017. It was last updated on 2021-02-21 using R Markdown.\nWhat is PsychBlog & Jelly?\nEinstein famously quipped that nobody understands anything until they can explain it to their grandmother. Given that my Korean language skills are dreadful on a good day, I suppose that I’m doomed to a life of not understanding anything past, “I’m hungry.”\nYet, in spite of myself, I’ve managed to learn a few things here and there about psychology, research, and life as an academic. My hope is to share some of the things I’ve learned, on the off chance that someone else finds it helpful.\nWhat can I expect to see on PsychBlog & Jelly?\nHonestly, I’m not sure either, but I hope it’ll be interesting.\nWhy PsychBlog & Jelly?\nI’m incorrigible when it comes to dumb backronyms.\nPeanut butter and jelly sandwiches are simple but satisfying. They don’t pretend to be anything special, but they’re a great go-to when you need a quick fix.\nI feel like I was trying to sketch the outlines for some quasi-deep metaphor, but now I’m just hungry.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-10-28T15:19:23-04:00",
    "input_file": {}
  }
]
